app/Codes/Forms/User/Form.php

    public function update($id, $request){

        $stockDTO = $this->mapper->filter($request, userDTO::userUpdateDTO);

        $this->validator->valid($stockDTO, userDTO::userUpdateRules);

        $request = array_filter($request);

        $request['is_enable'] = $request['is_enable'] ?? "off";

        $request['password'] = Hash::make($request['password']);

        $user = $this->userRepository->findOrFail($id);

        $user->update($request);

        $user->province()->detach();

        $user->province()->attach($request['region']);

        $user->syncRoles($request['role']);
---
update `users` set `password` = 'y$Tp/9b0kDS9W8KL1V0x6otuq16nEycunYnJnX/q.W5RSoXPKn4PeQu', `users`.`updated_at` = '2021-08-06 11:26:19' where `id` = 44
insert into `user_region` (`province_id`, `user_id`) values ('32', 44)
delete from `user_region` where `user_id` = 44