app/Http/Controllers/DashboardController.php

    public function index(): \Illuminate\Contracts\Support\Renderable
    {
        $role = auth()->user()->hasPermissionTo('admin');
        if ($role){
            return view('dashboard');
        }

        $user = auth()->user()->id;

        $stocks = StockRequest::select('total_stock')->where("user_id", $user)->sum('total_stock');
---
select sum(`total_stock`) as aggregate from `stock_request` where `user_id` = 2 and `stock_request`.`deleted_at` is null