app/Http/Controllers/StockControlController.php

    public function index(){

        $users = $this->userRepository->role('RPA')->with('stock.product')->get();
---
select * from `stock` where `stock`.`user_id` in (41) and `stock`.`deleted_at` is null

    public function upload($sjId){

        $request = $this->stockRequestRepository->findOrFail($sjId)->with('stock_request_items.products.sack', 'stock_request_items.products.category')->findOrFail($sjId);
---
select * from `categories` where `categories`.`id` in (15) and `categories`.`deleted_at` is null
select * from `product` where `product`.`id` in (24, 25, 26, 27, 28) and `product`.`deleted_at` is null
select * from `sack` where `sack`.`product_id` in (24, 25, 26, 27, 28)
select * from `stock_request_item` where `stock_request_item`.`stock_request_id` in ('BAC-Z0GLXOT')

    public function request(){

        $stock = $this->stockRequestRepository
            ->where(["is_confirmed" => 0])
            ->orderBy('date', 'ASC')
            ->with("stock_request_items")
            ->get();

        $request = StockRequestProcess::orderBy('date', 'ASC')
            ->with("stock_request_process_items")
            ->get();
---
select * from `stock_request_item` where `stock_request_item`.`stock_request_id` in ('BAC-E4C90Q6')
select * from `stock_request` where (`is_confirmed` = 0) and `stock_request`.`deleted_at` is null order by `date` asc
select * from `stock_request_process_item` where `stock_request_process_item`.`stock_request_process_id` in ('BAC-L19751F')
select * from `stock_request_process` where `stock_request_process`.`deleted_at` is null order by `date` asc

    public function history(){

        $request = StockRequestConfirmation::orderBy('date', 'ASC')
            ->with("stock_request_confirmation_items")
            ->get();
---
select * from `stock_request_confirmation_item` where `stock_request_confirmation_item`.`stock_request_confirmation_id` in ('BAC-3W2CFFD', 'BAC-6EPE8SP', 'BAC-R0UEADO')
select * from `stock_request_confirmation` where `stock_request_confirmation`.`deleted_at` is null order by `date` asc

    public function requestConfirmation($userId, $orderId){

        $request = StockRequestProcess::findOrfail($orderId)->with('stock_request_process_items')->first();
---
select * from `stock_request_process_item` where `stock_request_process_item`.`stock_request_process_id` in ('BAC-R0UEADO')
select * from `stock_request_process` where `stock_request_process`.`deleted_at` is null limit 1

    public function downloadRequestStoreFile($userId, $orderId){

        $user = $this->userRepository->find($userId);

        $origin = $user->province->first();

        $destination = auth()->user()->province->first();
---
select `provinces`.*, `user_region`.`user_id` as `pivot_user_id`, `user_region`.`province_id` as `pivot_province_id` from `provinces` inner join `user_region` on `provinces`.`id` = `user_region`.`province_id` where `user_region`.`user_id` = 41

    public function downloadHistoryRequest($userId, $orderId){

        $user = $this->userRepository->find($userId);

        $origin = $user->province->first();

        $destination = auth()->user()->province->first();
---
select `provinces`.*, `user_region`.`user_id` as `pivot_user_id`, `user_region`.`province_id` as `pivot_province_id` from `provinces` inner join `user_region` on `provinces`.`id` = `user_region`.`province_id` where `user_region`.`user_id` = 41
select `provinces`.*, `user_region`.`user_id` as `pivot_user_id`, `user_region`.`province_id` as `pivot_province_id` from `provinces` inner join `user_region` on `provinces`.`id` = `user_region`.`province_id` where `user_region`.`user_id` = 42