app/Http/Controllers/StockController.php

select `total_stock` from `stock_request` where `user_id` = 5 and `stock_request`.`deleted_at` is null
select sum(`total_stock`) as aggregate from `stock_request` where `user_id` = 1 and `stock_request`.`deleted_at` is null
---
    public function index(Request $request){

        $user = auth()->user()->id;

        $stocks = StockRequest::select('total_stock')->where("user_id", $user)->sum('total_stock');

select * from `stock_request_item` where `stock_request_item`.`stock_request_id` in ('BAC-CDC54DE')
---
    public function history(){

        $user = auth()->user()->id;

        $history = StockRequest::where("user_id", $user)->orderBy('created_at', 'DESC')->with('stock_request_item')->get();

select * from `stock_request_item` where `stock_request_item`.`stock_request_id` in ('BAC-067649C')
select * from `stock_request` where `id` = 'BAC-067649C' and `stock_request`.`deleted_at` is null limit 1
---
    public function downloadPDF($id){

        $this->checkStockTripById($id);

        $history = StockRequest::where("id", $id)->with('stock_request_item')->first();

select * from `stock_request_item` where `stock_request_item`.`stock_request_id` in ('BAC-067649C', 'BAC-CDC54DE')
---
    public function view($id){

        $this->checkStockTripById($id);

        $history = StockRequest::where("id", $id)->with('stock_request_item')->first();

select * from `stock_request_item` where `stock_request_item`.`stock_request_id` in ('BAC-4A26BA0', 'BAC-A5B5735', 'BAC-E5378EE', 'BAC-E8C0E4F')
select * from `stock_request` where `user_id` = 2 and `created_at` between '2021-05-23 00:12:44' and '2021-06-02 00:12:44' and `stock_request`.`deleted_at` is null order by `created_at` desc
---
    public function checkTrip(Request $request)
    {

        $user = auth()->user()->id;

        $data = StockRequest::where("user_id", $user)->orderBy('created_at', 'DESC')->with('stock_request_item')->get();