app/Http/Controllers/StockController.php

select * from `stock_request_item` where `stock_request_item`.`stock_request_id` in ('BAC-41FQRS8')
select * from `stock_request` where (`user_id` = 41) and (`is_confirmed` = 0) and `stock_request`.`deleted_at` is null
select * from `stock_request_process_item` where `stock_request_process_item`.`stock_request_process_id` in ('BAC-3X2S2Y4')
select * from `stock_request_process` where (`user_id` = 41) and `stock_request_process`.`deleted_at` is null
---
    public function requestStock(Request $request)
    {

        $stocks = $this->stockRequestRepository->where(["user_id" => auth()->user()->id])->with('stock_request_items')->where(["is_confirmed" => 0])->get();

        $request = StockRequestProcess::where(["user_id" => auth()->user()->id])->with('stock_request_process_items')->get();

select * from `stock_request_item` where `stock_request_item`.`stock_request_id` in ('BAC-41FQRS8')
select * from `stock_request` where (`user_id` = 41) and (`is_confirmed` = 1) and `stock_request`.`deleted_at` is null
---
    public function historyRequestStock(Request $request)
    {

        $stocks = $this->stockRequestRepository->where(["user_id" => auth()->user()->id])->with('stock_request_items')->where(["is_confirmed" => 1])->get();