app/Http/Controllers/UserController.php

    public function index(){
        $users = User::with('roles')->get();
---
select * from `users`

    public function create(){
        $roles = Role::all();
---
select * from `roles`