app/Codes/Forms/StockOpname/Form.php

select `provinces`.*, `user_region`.`user_id` as `pivot_user_id`, `user_region`.`province_id` as `pivot_province_id` from `provinces` inner join `user_region` on `provinces`.`id` = `user_region`.`province_id` where `user_region`.`user_id` = 41
---
    public function requestStore($sjId, $input){

        $stockDTO = $this->mapper->filter($input, stockDTO::requestStockDTO);

        $validator = $this->validator->valid($stockDTO, stockDTO::requestStockRules);

        if (!$validator['status']){

            return errorResponse(['stock_request_error' => $validator['message']]);

        }

        $destination = auth()->user()->province[0]['name'];

        $origin = $this->userRepository->find($input['user_id'])->province[0]['name'];